{"pageProps":{"postData":{"id":"how-to-find-moorage-as-a-liveaboard","contentHtml":"<p>Finding a place to keep your sailboat is one of the most important parts of liveaboard life. Whether you're heading home from a day of sailing or just turning in for the night, you'll need a place to keep your sailboat. In this post, we'll explore the moorage options available to liveaboards.</p>\n<h1>Marinas and yacht clubs</h1>\n<p>Marinas are a popular choice for many liveaboards when deciding where to keep their boat. Many marinas have facilities available to tenants, and most provide guest moorage for temporary stays. One detail liveaboards need to pay attention to is a marina's rules regarding liveaboards. Many jurisdictions limit the number of liveaboards a marina can have, and in some popular locations, it can be difficult to secure a slip with liveaboard permissions.\nMany liveaboards have been able to secure their liveaboard slip by purchasing their sailboat under agreement that they will be able to keep the sailboat in its existing liveaboard slip. If you can't purchase a sailboat that already has a liveaboard slip, other options include signing up for a marina's liveaboard waitlist, or finding a different place to keep your boat, keep reading below!</p>\n<h1>Mooring balls</h1>\n<p>A mooring ball is a floating buoy that is permanently attached to the sea floor. A liveaboard can moor their sailboat to the buoy with mooring lines.  Since mooring balls float in the water, liveaboards can use dinghies or other small boats in order to get to and from their sailboat. Sometimes marinas offer facilities to mooring ball tenants.\nMooring balls can leave a sailboat more exposed to wake and the elements, compared to marinas and yacht clubs. But mooring balls can be cheaper, and can prove to be a fun choice for adventurous types.</p>\n<h1>Anchoring</h1>\n<p>Anchoring is a great choice for liveaboards looking for the cheapest way to park their sailboat. As long as a liveaboard is aware of the depth and seabed conditions, they can deploy an anchor and be confident their sailboat will be secure. Similar to using a mooring ball, if a liveaboard is wishing to get to shore from their anchorage, they can use their dinghy or other small boat.</p>\n","date":"2020-10-25","title":"How to find moorage as a liveaboard"}},"__N_SSG":true}